In [1]:
import numpy as np 
import pandas as pd
import seaborn as sns

In [3]:
df = pd.read_csv(r'C:\labs\src\datasets\성적통계.csv', encoding='ansi')
df

    학년  반  번호 성별    성명   국어   수학   영어     물리    경제
0    1  1   1  남   학생1  100  100   95    NaN   NaN
1    1  1   2  여   학생2   65   65   95    NaN   NaN
2    1  1   3  여   학생3   85   85   75    NaN   NaN
3    1  1   4  남   학생4   70   95   90    NaN   NaN
4    1  1   5  남   학생5  100   80   75    NaN   0.0
5    1  2   1  여   학생6  100   55   60   85.0  50.0
6    1  2   2  남   학생7   70   55  100    NaN  95.0
7    1  2   3  여   학생8   60   80   95   55.0   NaN
8    1  2   4  남   학생9   70   80   75   55.0   NaN
9    1  2   5  여  학생10   55   80   95   90.0  75.0
10   1  3   1  남  학생11   65   65   70    NaN   NaN
11   1  3   2  남  학생12   95   90   90   70.0   NaN
12   1  3   3  여  학생13   55   50   85    NaN  95.0
13   1  3   4  남  학생14   90   60   75  100.0  85.0
14   1  3   5  여  학생15   55   90   75   95.0  55.0

In [8]:
df.index, df.columns, df.size

(RangeIndex(start=0, stop=15, step=1),
 Index(['학년', '반', '번호', '성별', '성명', '국어', '수학', '영어', '물리', '경제'], dtype='object'),
 150)

In [9]:
df.drop(['학년', '반', '번호', '성별'], axis=1, inplace=True)
df

      성명   국어   수학   영어     물리    경제
0    학생1  100  100   95    NaN   NaN
1    학생2   65   65   95    NaN   NaN
2    학생3   85   85   75    NaN   NaN
3    학생4   70   95   90    NaN   NaN
4    학생5  100   80   75    NaN   0.0
5    학생6  100   55   60   85.0  50.0
6    학생7   70   55  100    NaN  95.0
7    학생8   60   80   95   55.0   NaN
8    학생9   70   80   75   55.0   NaN
9   학생10   55   80   95   90.0  75.0
10  학생11   65   65   70    NaN   NaN
11  학생12   95   90   90   70.0   NaN
12  학생13   55   50   85    NaN  95.0
13  학생14   90   60   75  100.0  85.0
14  학생15   55   90   75   95.0  55.0

In [10]:
# 성명을 행인댁스로 지정 
df.set_index('성명', inplace=True)
df

       국어   수학   영어     물리    경제
성명
학생1   100  100   95    NaN   NaN
학생2    65   65   95    NaN   NaN
학생3    85   85   75    NaN   NaN
학생4    70   95   90    NaN   NaN
학생5   100   80   75    NaN   0.0
학생6   100   55   60   85.0  50.0
학생7    70   55  100    NaN  95.0
학생8    60   80   95   55.0   NaN
학생9    70   80   75   55.0   NaN
학생10   55   80   95   90.0  75.0
학생11   65   65   70    NaN   NaN
학생12   95   90   90   70.0   NaN
학생13   55   50   85    NaN  95.0
학생14   90   60   75  100.0  85.0
학생15   55   90   75   95.0  55.0

In [24]:
df.fillna(0, inplace=True)
df

       국어   수학   영어     물리    경제
성명
학생1   100  100   95    0.0   0.0
학생2    65   65   95    0.0   0.0
학생3    85   85   75    0.0   0.0
학생4    70   95   90    0.0   0.0
학생5   100   80   75    0.0   0.0
학생6   100   55   60   85.0  50.0
학생7    70   55  100    0.0  95.0
학생8    60   80   95   55.0   0.0
학생9    70   80   75   55.0   0.0
학생10   55   80   95   90.0  75.0
학생11   65   65   70    0.0   0.0
학생12   95   90   90   70.0   0.0
학생13   55   50   85    0.0  95.0
학생14   90   60   75  100.0  85.0
학생15   55   90   75   95.0  55.0

In [28]:
df.corr()

          국어        수학        영어        물리        경제
국어  1.000000  0.159839 -0.311279 -0.013638 -0.279372
수학  0.159839  1.000000  0.220669  0.009741 -0.616225
영어 -0.311279  0.220669  1.000000 -0.270291  0.042298
물리 -0.013638  0.009741 -0.270291  1.000000  0.337243
경제 -0.279372 -0.616225  0.042298  0.337243  1.000000